//======================================================================================================================
//
//	区域ヘッダー [area.h]
//	Author：藤田勇一
//
//======================================================================================================================
#ifndef _AREA_H_			// このマクロ定義がされていない場合
#define _AREA_H_			// 二重インクルード防止のマクロを定義する

//**********************************************************************************************************************
//	列挙型定義 (AREATYPE)
//**********************************************************************************************************************
typedef enum
{
	AREATYPE_SAFE = 0,		// セーフエリア
	AREATYPE_01,			// 第一エリア
	AREATYPE_02,			// 第二エリア
	AREATYPE_03,			// 第三エリア
	AREATYPE_04,			// 第四エリア
	AREATYPE_RED,			// レッドエリア
	AREATYPE_MAX,			// この列挙型の総数
} AREATYPE;

//**********************************************************************************************************************
//	プロトタイプ宣言
//**********************************************************************************************************************
void InitArea(void);			// 区域の初期化処理
void UninitArea(void);			// 区域の終了処理
void UpdateArea(void);			// 区域の更新処理
void DrawArea(void);			// 区域の描画処理
AREATYPE GetCurrentArea(void);	// 区域の取得処理
float GetAreaSize(int areatype); //区域の範囲を取得

#endif