//============================================================
//
//	移動範囲ヘッダー [limit.h]
//	Author：藤田勇一
//
//============================================================
#ifndef _LIMIT_H_			// このマクロ定義がされていない場合
#define _LIMIT_H_			// 二重インクルード防止のマクロを定義する

//************************************************************
//	構造体定義 (Limit)
//************************************************************
typedef struct
{
	float fNear;			// 移動範囲 (手前)
	float fFar;				// 移動範囲 (奥)
	float fRight;			// 移動範囲 (右)
	float fLeft;			// 移動範囲 (左)
	float fField;			// 移動範囲 (地面)
}Limit;

//************************************************************
//	プロトタイプ宣言
//************************************************************
void InitLimit(void);		// 移動範囲の初期化処理
void SetLimit(Limit limit);	// 移動範囲の設定処理
Limit GetLimit(void);		// 移動範囲の取得処理

#endif