//==========================================
//
//  ゲームモードの制御(game.cpp)
//  Author : Tomoya Kanazaki
//
//==========================================
#include "game.h"
#include "pause.h"
#include "fade.h"
#include "input.h"

//==========================================
//  初期化処理
//==========================================
void InitGame()
{
	//ポーズの初期化
	InitPause();
}

//==========================================
//  終了処理
//==========================================
void UninitGame()
{
	//ポーズの終了
	UninitPause();
}

//==========================================
//  更新処理
//==========================================
void UpdateGame()
{
	//ポーズの更新
	UpdatePause();

	//ポーズ中じゃない場合
	if(GetPause() == false)
	{

	}

	//フェード
	if (GetKeyboardTrigger(DIK_RETURN))
	{
		SetFade(MODE_RESULT);
	}
}

//==========================================
//  描画処理
//=========================================
void DrawGame()
{
	//ポーズの描画
	DrawPause();
}
