//============================================================
//
//	移動範囲処理 [limit.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "limit.h"

//************************************************************
//	マクロ定義
//************************************************************
#define LAND_POS	(0.0f)		// 着地座標

//************************************************************
//	グローバル変数
//************************************************************
Limit g_limit;					// 移動範囲の情報

//============================================================
//	移動範囲の初期化処理
//============================================================
void InitLimit(void)
{
	// ステージの移動範囲の情報を初期化
	g_limit.fNear  = 0.0f;				// 移動範囲 (手前)
	g_limit.fFar   = 0.0f;				// 移動範囲 (奥)
	g_limit.fRight = 0.0f;				// 移動範囲 (右)
	g_limit.fLeft  = 0.0f;				// 移動範囲 (左)
	g_limit.fField = LAND_POS;			// 移動範囲 (地面)
}

//============================================================
//	移動範囲の設定処理
//============================================================
void SetLimit(Limit limit)
{
	// 引数の移動範囲を代入
	g_limit.fNear  = limit.fNear;		// 移動範囲 (手前)
	g_limit.fFar   = limit.fFar;		// 移動範囲 (奥)
	g_limit.fRight = limit.fRight;		// 移動範囲 (右)
	g_limit.fLeft  = limit.fLeft;		// 移動範囲 (左)
	g_limit.fField = limit.fField;		// 移動範囲 (地面)
}

//============================================================
//	移動範囲の取得処理
//============================================================
Limit GetLimit(void)
{
	// 移動範囲を返す
	return g_limit;
}
